[
    {
        "name": "ItCoolab",
        "technologies": ["JavaScript", "Tailwind", "CSS", "React", "Next.js"],
        "challenge": "Trabajé junto a una desarrolladora UX/UI y, al principio, fue un reto importar los modelos de Figma, ya que nunca había trabajado con un profesional UX/UI. Aun así, aprendí sobre la marcha y pude implementar correctamente los estilos.",
        "desc": "ItCoolab iba a ser una plataforma en la que se pudieran realizar proyectos junto a otros juniors. Estaba orientada principalmente al rubro IT, pero el desarrollo fue descontinuado.",
        "url": "https://coolab.vercel.app/",
        "urlRepo": "https://github.com/Noegraf/Coolab",
        "img": "/proyectImages/itcoolab.png"
    },
    {
        "name": "Clientes y Empresas",
        "technologies": ["TypeScript", "Tailwind", "CSS", "React", "Next.js", "Java", "Spring Boot", "MySQL", "JPA/Hibernate"],
        "challenge": "El mayor desafío de este proyecto fue el armado de las relaciones en la base de datos y la lógica de algunos endpoints. Sin embargo, pude resolverlo informándome sobre los diagramas de entidad-relación (DER) y aplicándolos al proyecto.",
        "desc": "Este proyecto es una simulación sobre clientes que realizan compras a una empresa. Se puede ver tanto desde la vista del cliente como desde la de la empresa. Me enfoqué principalmente en el backend y en el diseño de las relaciones de ventas en la base de datos.",
        "url": "https://clientes-y-empresa.vercel.app/",
        "urlRepo": "https://github.com/facufan07/clientes-y-empresa",
        "img": "/proyectImages/manejoVentas.png"
    },
    {
        "name": "Market Coffee",
        "technologies": ["JavaScript", "SASS", "CSS", "React", "Next.js"],
        "challenge": "El único desafío fue implementar la lógica de filtrado, pero logré hacerlo por mi cuenta.",
        "desc": "Es un proyecto enfocado en la integración de una API de cafés. La única funcionalidad que tiene es la posibilidad de filtrar entre los productos que tienen stock y los que no.",
        "url": "https://coffee-gamma-two.vercel.app/",
        "urlRepo": "https://github.com/facufan07/coffee",
        "img": "/proyectImages/coffee.png"
    }
]